hdscmcu/pack/HDSC.HC32F4A0.pdsc
        <condition id = "HC32F4A0PITB">
            <require Dname="HC32F4A0PITB"/>
        </condition>
        <condition id = "HC32F4A0SGTB">
            <require Dname="HC32F4A0SGTB"/>
        </condition>
        <condition id = "HC32F4A0SGHB">
            <require Dname="HC32F4A0SGHB"/>
        </condition>
        <condition id = "HC32F4A0RGTB">
            <require Dname="HC32F4A0RGTB"/>
        </condition>
        <condition id = "HC32F4A0PGTB">
            <require Dname="HC32F4A0PGTB"/>
        </condition>
        <condition id = "HC32F4A0PIHB">
            <require Dname="HC32F4A0PIHB"/>
        </condition>
        <condition id = "HC32F4A0PGHB">
            <require Dname="HC32F4A0PGHB"/>
        </condition>
        <!-- Device + CMSIS Conditions -->
        <condition id="HC32F4A0 CMSIS">
            <description>HDSC HC32F4A0 Series devices and CMSIS-CORE</description>
            <require condition="HC32F4A0"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
    </conditions>

    <components>
    <!-- Startup HC32F4A0 -->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HC32F4A0 CMSIS">
            <description>System Startup for HC32F4A0 series</description>
            <RTE_Components_h>
            <!-- the following content goes into file 'RTE_Components.h' -->
            <!--#define RTE_DEVICE_STARTUP_HC32F4A0    /* Device Startup for HC32F4A0 */-->
            </RTE_Components_h>

            <files>
                <!-- include folder -->
                <file category="include" name="Device/Include/"/>
                <file category="header" name="Device/Include/HC32F4A0.h"/>
                <file category="header" name="Device/Include/HC32F4A0TIHB.h" condition="HC32F4A0TIHB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0SITB.h" condition="HC32F4A0SITB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0SIHB.h" condition="HC32F4A0SIHB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0RITB.h" condition="HC32F4A0RITB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0PITB.h" condition="HC32F4A0PITB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0SGTB.h" condition="HC32F4A0SGTB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0SGHB.h" condition="HC32F4A0SGHB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0RGTB.h" condition="HC32F4A0RGTB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0PGTB.h" condition="HC32F4A0PGTB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0PIHB.h" condition="HC32F4A0PIHB" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F4A0PGHB.h" condition="HC32F4A0PGHB" attr="config" version="1.0.0"/>
                <!-- startup file -->
                <file category="source" name="Device/Source/ARM/startup_hc32f4a0.s" attr="config" version="1.0.0" condition="Compiler ARM"/>
                <file category="source" name="Device/Source/IAR/startup_hc32f4a0.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
                <!-- system file -->
                <file category="source" name="Device/Source/system_hc32f4a0.c"  attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/system_hc32f4a0.h" attr="config" version="1.0.0"/>
                <!-- example file -->
                <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="1.0.0"/>
            </files>
        </component>
    </components>

    <boards>
        <board vendor="HDSC" name="EV_F4A0_LQ176_Rev1.0">
            <description>HC32F4A0 176-Pin Target board</description>
            <mountedDevice    deviceIndex="0" Dvendor="HDSC:145" Dname="HC32F4A0SITB"/>
            <compatibleDevice deviceIndex="0" Dvendor="HDSC:145" Dfamily="HC32F4A0-Series" DsubFamily="HC32F4A0"/>
            <debugInterface adapter="JTAG/SW" connector="CMSIS_DAP Debug Connector (MicroUSB connector)"/>
        </board>
    </boards>


    <examples>
        <example name="EmptyMain" folder="Examples/EmptyMain" doc="Abstract.txt" version="1.0.0">
        <description>This is a basic example providing an empty main body</description>
        <board name="EV_F4A0_LQ176_Rev1.0" vendor="HDSC"/>
        <project>
            <environment name="uv"  load="ARM/EmptyMain.uvprojx"/>
            <environment name="iar" load="IAR/EmptyMain/EmptyMain.ewp" />
        </project>
        <attributes>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <keyword>Empty</keyword>
            <keyword>Main</keyword>
            <keyword>Getting Started</keyword>
        </attributes>
        </example>
    </examples>


</package>
